# qamar_app/models.py

from django.db import models


SURAH_NAMES = [
    ('سورة الفَاتِحَة', 'سورة الفَاتِحَة'), #('value', 'display_value')
    ('سورة البَقَرَة', 'سورة البَقَرَة'),
    ('سورة آل عِمرَان', 'سورة آل عِمرَان'),
    ('سورة النِّسَاء', 'سورة النِّسَاء'),
    ('سورة المَائدة', 'سورة المَائدة'),
    ('سورة الأنعَام', 'سورة الأنعَام'),
    ('سورة الأعرَاف', 'سورة الأعرَاف'),
    ('سورة الأنفَال', 'سورة الأنفَال'),
    ('سورة التوبَة', 'سورة التوبَة'),
    ('سورة يُونس', 'سورة يُونس'),
    ('سورة هُود', 'سورة هُود'),
    ('سورة يُوسُف', 'سورة يُوسُف'),
    ('سورة الرَّعْد', 'سورة الرَّعْد'),
    ('سورة إبراهِيم', 'سورة إبراهِيم'),
    ('سورة الحِجْر', 'سورة الحِجْر'),
    ('سورة النَّحْل', 'سورة النَّحْل'),
    ('سورة الإسْرَاء', 'سورة الإسْرَاء'),
    ('سورة الكهْف', 'سورة الكهْف'),
    ('سورة مَريَم', 'سورة مَريَم'),
    ('سورة طه', 'سورة طه'),
    ('سورة الأنبيَاء', 'سورة الأنبيَاء'),
    ('سورة الحَج', 'سورة الحَج'),
    ('سورة المُؤمنون', 'سورة المُؤمنون'),
    ('سورة النُّور', 'سورة النُّور'),
    ('سورة الفُرْقان', 'سورة الفُرْقان'),
    ('سورة الشُّعَرَاء', 'سورة الشُّعَرَاء'),
    ('سورة النَّمْل', 'سورة النَّمْل'),
    ('سورة القَصَص', 'سورة القَصَص'),
    ('سورة العَنكبوت', 'سورة العَنكبوت'),
    ('سورة الرُّوم', 'سورة الرُّوم'),
    ('سورة لقمَان', 'سورة لقمَان'),
    ('سورة السَّجدَة', 'سورة السَّجدَة'),
    ('سورة الأحزَاب', 'سورة الأحزَاب'),
    ('سورة سَبَأ', 'سورة سَبَأ'),
    ('سورة فَاطِر', 'سورة فَاطِر'),
    ('سورة يس', 'سورة يس'),
    ('سورة الصَّافات', 'سورة الصَّافات'),
    ('سورة ص', 'سورة ص'),
    ('سورة الزُّمَر', 'سورة الزُّمَر'),
    ('سورة غَافِر', 'سورة غَافِر'),
    ('سورة فُصِّلَتْ', 'سورة فُصِّلَتْ'),
    ('سورة الشُّورَى', 'سورة الشُّورَى'),
    ('سورة الزُّخْرُف', 'سورة الزُّخْرُف'),
    ('سورة الدُّخان', 'سورة الدُّخان'),
    ('سورة الجاثِية', 'سورة الجاثِية'),
    ('سورة الأحقاف', 'سورة الأحقاف'),
    ('سورة مُحَمّد', 'سورة مُحَمّد'),
    ('سورة الفَتْح', 'سورة الفَتْح'),
    ('سورة الحُجُرات', 'سورة الحُجُرات'),
    ('سورة ق', 'سورة ق'),
    ('سورة الذَّاريَات', 'سورة الذَّاريَات'),
    ('سورة الطُّور', 'سورة الطُّور'),
    ('سورة النَّجْم', 'سورة النَّجْم'),
    ('سورة القَمَر', 'سورة القَمَر'),
    ('سورة الرَّحمن', 'سورة الرَّحمن'),
    ('سورة الواقِعَة', 'سورة الواقِعَة'),
    ('سورة الحَديد', 'سورة الحَديد'),
    ('سورة المُجادَلة', 'سورة المُجادَلة'),
    ('سورة الحَشْر', 'سورة الحَشْر'),
    ('سورة المُمتَحَنة', 'سورة المُمتَحَنة'),
    ('سورة الصَّف', 'سورة الصَّف'),
    ('سورة الجُّمُعة', 'سورة الجُّمُعة'),
    ('سورة المُنافِقُون', 'سورة المُنافِقُون'),
    ('سورة التَّغابُن', 'سورة التَّغابُن'),
    ('سورة الطَّلاق', 'سورة الطَّلاق'),
    ('سورة التَّحْريم', 'سورة التَّحْريم'),
    ('سورة المُلْك', 'سورة المُلْك'),
    ('سورة القَلـَم', 'سورة القَلـَم'),
    ('سورة الحَاقَّة', 'سورة الحَاقَّة'),
    ('سورة المَعارِج', 'سورة المَعارِج'),
    ('سورة نُوح', 'سورة نُوح'),
    ('سورة الجِنّ', 'سورة الجِنّ'),
    ('سورة المُزَّمِّل', 'سورة المُزَّمِّل'),
    ('سورة المُدَّثــر', 'سورة المُدَّثــر'),
    ('سورة القِيامَة', 'سورة القِيامَة'),
    ('سورة الإنسان', 'سورة الإنسان'),
    ('سورة المُرسَلات', 'سورة المُرسَلات'),
    ('سورة النَّبأ', 'سورة النَّبأ'),
    ('سورة النَّـازِعات', 'سورة النَّـازِعات'),
    ('سورة عَبَس', 'سورة عَبَس'),
    ('سورة التَّـكْوير', 'سورة التَّـكْوير'),
    ('سورة الإنفِطار', 'سورة الإنفِطار'),
    ('سورة المُطَـفِّفين', 'سورة المُطَـفِّفين'),
    ('سورة الإنشِقاق', 'سورة الإنشِقاق'),
    ('سورة البُروج', 'سورة البُروج'),
    ('سورة الطّارق', 'سورة الطّارق'),
    ('سورة الأعلی', 'سورة الأعلی'),
    ('سورة الغاشِيَة', 'سورة الغاشِيَة'),
    ('سورة الفَجْر', 'سورة الفَجْر'),
    ('سورة البَـلـَد', 'سورة البَـلـَد'),
    ('سورة الشَّــمْس', 'سورة الشَّــمْس'),
    ('سورة اللَّـيل', 'سورة اللَّـيل'),
    ('سورة الضُّحی', 'سورة الضُّحی'),
    ('سورة الشَّرْح', 'سورة الشَّرْح'),
    ('سورة التِّـين', 'سورة التِّـين'),
    ('سورة العَلَـق', 'سورة العَلَـق'),
    ('سورة القَـدر', 'سورة القَـدر'),
    ('سورة البَيِّنَة', 'سورة البَيِّنَة'),
    ('سورة الزلزَلة', 'سورة الزلزَلة'),
    ('سورة العَادِيات', 'سورة العَادِيات'),
    ('سورة القارِعَة', 'سورة القارِعَة'),
    ('سورة التَكاثُـر', 'سورة التَكاثُـر'),
    ('سورة العَصْر', 'سورة العَصْر'),
    ('سورة الهُمَزَة', 'سورة الهُمَزَة'),
    ('سورة الفِيل', 'سورة الفِيل'),
    ('سورة قُـرَيْش', 'سورة قُـرَيْش'),
    ('سورة المَاعُون', 'سورة المَاعُون'),
    ('سورة الكَوْثَر', 'سورة الكَوْثَر'),
    ('سورة الكَافِرُون', 'سورة الكَافِرُون'),
    ('سورة النَّـصر', 'سورة النَّـصر'),
    ('سورة المَسَد', 'سورة المَسَد'),
    ('سورة الإخْلَاص', 'سورة الإخْلَاص'),
    ('سورة الفَلَق', 'سورة الفَلَق'),
    ('سورة النَّاس', 'سورة النَّاس')
]
class QuranWord(models.Model):
    idquran_words = models.AutoField(primary_key=True)  # remove default
    surah_name = models.CharField(max_length=100, choices=SURAH_NAMES)
    uthmani = models.CharField(max_length=100)
    msa = models.CharField(max_length=100)
    stem = models.CharField(max_length=100)
    lemma = models.CharField(max_length=100)
    root = models.CharField(max_length=100)
    pos1 = models.CharField(max_length=50)
    pos2 = models.CharField(max_length=50)

    class Meta:
        db_table = 'quran_words'

    def __str__(self):
        return f"{self.surah_name} - {self.uthmani}"
    
class CorrectionSuggestion(models.Model):
    line_number = models.IntegerField()
    lemma = models.CharField(max_length=255)
    msa = models.CharField(max_length=255)
    pos1 = models.CharField(max_length=255)
    pos2 = models.CharField(max_length=255)
    root = models.CharField(max_length=255)
    stem = models.CharField(max_length=255)

    class Meta:
        db_table = 'qamar_app_correctionsuggestion' 
